In [57]:
import pandas as pd

In [58]:
#create
data = {
    "name":["a","b","c"],
    "age":[28,25,32]
}
df = pd.DataFrame(data)
df

  name  age
0    a   28
1    b   25
2    c   32

In [59]:
#read
df = pd.read_csv("data.csv")
df

      Name  Age  Salary
0    hasan   32    1000
1      ali   33    4000
2    vahid   32    2500
3   behnam   33    3400
4  mahmoud   30    2400
5    zahra   28    3300
6   maryam   28    2700

In [60]:
df.head()

      Name  Age  Salary
0    hasan   32    1000
1      ali   33    4000
2    vahid   32    2500
3   behnam   33    3400
4  mahmoud   30    2400

In [61]:
df.describe()

             Age       Salary
count   7.000000     7.000000
mean   30.857143  2757.142857
std     2.193063   960.654539
min    28.000000  1000.000000
25%    29.000000  2450.000000
50%    32.000000  2700.000000
75%    32.500000  3350.000000
max    33.000000  4000.000000

In [62]:
df["Name"]

0      hasan
1        ali
2      vahid
3     behnam
4    mahmoud
5      zahra
6     maryam
Name: Name, dtype: object

In [63]:
df.iloc[2,:]

Name      vahid
Age          32
Salary     2500
Name: 2, dtype: object

In [64]:
df.iloc[4,2]

2400

In [65]:
#filter
f_df = df[df["Salary"]>2500]
f_df

     Name  Age  Salary
1     ali   33    4000
3  behnam   33    3400
5   zahra   28    3300
6  maryam   28    2700

In [66]:
#sort
df_sorted = df.sort_values("Salary", ascending=True)
df_sorted

      Name  Age  Salary
0    hasan   32    1000
4  mahmoud   30    2400
2    vahid   32    2500
6   maryam   28    2700
5    zahra   28    3300
3   behnam   33    3400
1      ali   33    4000

In [67]:
df_sorted = df.sort_values("Salary", ascending=False)
df_sorted

      Name  Age  Salary
1      ali   33    4000
3   behnam   33    3400
5    zahra   28    3300
6   maryam   28    2700
2    vahid   32    2500
4  mahmoud   30    2400
0    hasan   32    1000

In [68]:
#subset (trim)
ss=df.loc[2:4, ["Name", "Age"]]
ss

      Name  Age
2    vahid   32
3   behnam   33
4  mahmoud   30

In [69]:
#group
df_grouped = df.groupby("Age")
df_grouped

In [70]:
df

      Name  Age  Salary
0    hasan   32    1000
1      ali   33    4000
2    vahid   32    2500
3   behnam   33    3400
4  mahmoud   30    2400
5    zahra   28    3300
6   maryam   28    2700

In [71]:
df_grouped.count()

     Name  Salary
Age
28      2       2
30      1       1
32      2       2
33      2       2

In [72]:
#add a new column
df["Test"] = [1,2,3,4,5,6,7]

In [73]:
df

      Name  Age  Salary  Test
0    hasan   32    1000     1
1      ali   33    4000     2
2    vahid   32    2500     3
3   behnam   33    3400     4
4  mahmoud   30    2400     5
5    zahra   28    3300     6
6   maryam   28    2700     7

In [74]:
#delete a column
df.drop("Test", axis=1, inplace=True)
df

      Name  Age  Salary
0    hasan   32    1000
1      ali   33    4000
2    vahid   32    2500
3   behnam   33    3400
4  mahmoud   30    2400
5    zahra   28    3300
6   maryam   28    2700

In [75]:
len(df)

7

In [76]:
#add a new row
df.loc[len(df)] = {
    "Name" : "Test",
    "Age" : 22
}
df

      Name  Age  Salary
0    hasan   32  1000.0
1      ali   33  4000.0
2    vahid   32  2500.0
3   behnam   33  3400.0
4  mahmoud   30  2400.0
5    zahra   28  3300.0
6   maryam   28  2700.0
7     Test   22     NaN

In [77]:
df.isna()

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False    True

In [78]:
df1 = df.dropna()

In [55]:
df1

      Name  Age  Salary
0    hasan   32  1000.0
1      ali   33  4000.0
2    vahid   32  2500.0
3   behnam   33  3400.0
4  mahmoud   30  2400.0
5    zahra   28  3300.0
6   maryam   28  2700.0

In [56]:
df2 = df.fillna(0)
df2

      Name  Age  Salary
0    hasan   32  1000.0
1      ali   33  4000.0
2    vahid   32  2500.0
3   behnam   33  3400.0
4  mahmoud   30  2400.0
5    zahra   28  3300.0
6   maryam   28  2700.0
7     Test   22     0.0

In [79]:
#write
df.to_csv("new data.csv")